
infos = [['香港国际机场', '14/08/2023 07:15', 'UO618', '\n3h 35m', '仁川国际机场', '11:50', '已客满'], ['香港国际机场', '14/08/2023 10:40', 'UO630', '\n3h 40m', '仁川国际机场', '15:20', '已客满'], ['香港国际机场', '14/08/2023 16:50', 'UO626', '\n3h 45m', '仁川国际机场', '21:35', '1,568'], ['香港国际机场', '16/08/2023 07:15', 'UO618', '\n3h 35m', '仁川国际机场', '11:50', '1,898'], ['香港国际机场', '16/08/2023 10:40', 'UO630', '\n3h 40m', '仁川国际机场', '15:20', '已客满'], ['香港国际机场', '16/08/2023 16:50', 'UO626', '\n3h 45m', '仁川国际机场', '21:35', '1,308'], ['香港国际机场', '17/08/2023 07:15', 'UO618', '\n3h 35m', '仁川国际机场', '11:50', '已客满'], ['香港国际机场', '17/08/2023 10:40', 'UO630', '\n3h 40m', '仁川国际机场', '15:20', '已客满'], ['香港国际机场', '17/08/2023 16:50', 'UO626', '\n3h 45m', '仁川国际机场', '21:35', '1,568'], ['香港国际机场', '20/08/2023 07:15', 'UO618', '\n3h 35m', '仁川国际机场', '11:50', '已客满'], ['香港国际机场', '20/08/2023 09:10', 'UO630', '\n3h 40m', '仁川国际机场', '13:50', '2,298'], ['香港国际机场', '20/08/2023 16:50', 'UO626', '\n3h 45m', '仁川国际机场', '21:35', '已客满']]
print(infos)
print(len(infos))
print(range(len(infos)))


for i in range(5):
    print(i)